#include <stdio.h>

int main()
{
    int score_int = 90.5;
    printf("กรณีที่ 1 (int): score = %d\n", score_int);

    float score_float = 90.5f;
    printf("กรณีที่ 2 (float): score = %.1f\n", score_float);

    return 0;
}

//ผลลัพธ์ที่ได้เเตกต่างกันอย่างไร
  //กรณีที่ 1 จะเกิดข้อผิดพลาดในการคอมไพล์เนื่องจากการกำหนดค่า 90.5 ให้กับตัวแปรชนิด int ซึ่งไม่สามารถเก็บค่าทศนิยมได้
  //กรณีที่ 2 จะทำงานได้ถูกต้องเพราะใช้ float แทน int ซึ่งสามารถเก็บค่าทศนิยมได้ และจะแสดงผลลัพธ์เป็น 90.5
//ทำไมต้องเลือกใช้ Data Type
  //เพื่อความถูกต้องของข้อมูลเเตะละชนิดเพื่อเพิ่มประสิทธิภาพการใชหน่วยความจำและการประมวลผล เพื่อป้องกันข้อผิดพลาดที่อาจเกิดขึ้นจากการใช้ชนิดข้อมูลที่ไม่เหมาะสมของโปรเเกรม
//อธิปรายเเละสรุปผลการทำงานของการทดลอง
  //ทั้งสองกรณีแสดงให้เห็นถึงความสำคัญของการเลือกใช้ชนิดข้อมูลที่เหมาะสมความเเตกต่างพื้นฐานที่สำคัญระหว่าง int และ float ในการจัดเก็บข้อมูลทศนิยม
  //สรปุความสำคัญในการเลือกใช้ประเภทข้อมูลที่เหมาะสมตามลักษณะของข้อมูลที่กำลังถูกประมวลผล เเละกาเเสดงข้อมูบที่ไม่ถูกต้องภายในโปรแกรมถึงเเนวคิดของ Data Type Mismatch


