//ผลลัพธ์ที่ได้ต่างกันอย่างไร
  // ผลลัพธ์ที่ได้จะแตกต่างกันเนื่องจากตัวแปร `counter` ถูกประกาศเป็นแบบ static
  // ในไฟล์ `coding_w04-05-1.c` ซึ่งจะทำให้ค่าของ `counter` ถูกเก็บรักษาไว้ระหว่างการเรียกใช้ฟังก์ชัน
  // ในขณะที่ในไฟล์ `coding_w04-05.c` ตัวแปร `counter` เป็นตัวแปรที่ไม่ใช่ static ซึ่งจะถูกรีเซ็ตเป็น 0 ทุกครั้งที่ฟังก์ชัน `countCall` ถูกเรียกใช้
  // ดังนั้น ใน `coding_w04-05-1.c` จะเห็นค่าของ `counter` เพิ่มขึ้นทุกครั้งที่เรียกใช้ฟังก์ชัน `countCall`
//ความเเตกต่างของ Non-Static Variable
  // Non-static variable จะถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียกใช้ ทำให้ค่าของมันไม่ถูกเก็บรักษาไว้ระหว่างการเรียกใช้
//อธิบายเเละสรุปผลที่ได้จากการทดลอง
  // ใน `coding_w04-05.c` เมื่อเรียกใช้ฟังก์ชัน `countCall` จะพิมพ์ค่า `Counter = 1` ในครั้งแรก และ `Counter = 1` ในครั้งที่สอง
  // ในขณะที่ใน `coding_w04-05-1.c` จะพิมพ์ค่า `Counter = 1` ในครั้งแรก และ `Counter = 2` ในครั้งที่สอง
  // นี่แสดงให้เห็นถึงความแตกต่างระหว่างตัวแปร static และ non-static ในการเก็บค่าระหว่างการเรียกใช้ฟังก์ชัน
//สรปผลการทดลอง
  // การใช้ตัวแปร static ช่วยให้เราสามารถเก็บค่าระหว่างการเรียกใช้ฟังก์ชันได้ ในขณะที่ตัวแปร non-static จะถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียกใช้
  // การเลือกใช้ตัวแปรแบบใดขึ้นอยู่กับความต้องการในการเก็บค่าระหว่างการเรียกใช้ฟังก์ชัน